app/controllers/libros_controller.rb

SELECT * FROM `libros`
---
   def index
    @libros = Libro.all

SELECT * FROM `libros` WHERE (`libros`.`id` = 1)
---
  def show
    @libro = Libro.find(params[:id])

SELECT * FROM `libros` WHERE (`libros`.`id` = 1)
---
  def edit
    @libro = Libro.find(params[:id])

INSERT INTO `libros` (`updated_at`, `titulo`, `contenido`, `created_at`) VALUES('2010-10-25 02:51:43', 'uno', 'uno libro para editar es el numero 1\r\n', '2010-10-25 02:51:43')
---
  def create
    @libro = Libro.new(params[:libro])

    respond_to do |format|
      if @libro.save