app/controllers/users_controller.rb

INSERT INTO `users` (`status`, `updated_at`, `crypted_password`, `username`, `password_salt`, `persistence_token`, `type_user`, `email`, `created_at`) VALUES(NULL, '2010-10-24 18:26:45', '81f78cde4c9c46106bd4a4aa3b637d7063f788877ae72ad362e59f15b77bf21961049b31463897c008555f944c6d9727875a15f7fb9acc20416bac442c8e8f01', 'juanca', 'XVKFH8SqX2IpmqrHyfw', '9c2de1c60cb6a4303900de3b526bfcf588790d27af4879af18f2752e8963877f99664d44000394e7218af840bc74547eb564326e1faa7157bb6e1b46329c5347', NULL, 'juanca@gmail.comk', '2010-10-24 18:26:45')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `persistence_token` = 'be338b71e1bea1ec38490b6b3c13a3053b8d6659b22f1070af820d890766691e73a7a7508527a227b5d8f63748b3a6810e9899d13faf5180d503458a6341130e', `crypted_password` = '92b55aedf83b07f4bc6d24239c09b4293105ccc6feff2f6af12bea1beec764feab3ce0a03c8da7ad85303cff633a8a2b205d7c2f21d04791ffc714431e1f06ce', `updated_at` = '2010-10-25 00:29:45', `password_salt` = '78m2AeS8XWkFulT9yO5' WHERE `id` = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])